[{"data":1,"prerenderedAt":81},["ShallowReactive",2],{"content-query-qcBiS9krVv":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"desc":9,"body":10,"_type":76,"_id":77,"_source":78,"_file":79,"_extension":80},"/de/projects/tnt","projects",false,"","Terror Nightmare Towers - Hering","Terror Nightmare Towers ist ein Horror-Brettspiel, das auf dem beliebten Spiel Santorini basiert. In dieser düsteren Version bauen die Spieler Türme in einer von Albträumen heimgesuchten Stadt. Während du strategisch Türme errichtest, musst du gegen geisterhafte Kreaturen und übernatürliche Fallen kämpfen. Nutze spezielle Fähigkeiten, um den Schrecken zu trotzen und der beste Baumeister der Terror Nightmare Towers zu werden!",{"type":11,"children":12,"toc":73},"root",[13],{"type":14,"tag":15,"props":16,"children":19},"element","div",{"className":17},[18],"containermd",[20,28,35],{"type":14,"tag":21,"props":22,"children":24},"h1",{"id":23},"terror-nightmare-towers",[25],{"type":26,"value":27},"text","Terror Nightmare Towers",{"type":14,"tag":15,"props":29,"children":32},{"className":30},[31],"date",[33],{"type":26,"value":34},"\nErscheinungsdatum: 02.08.2023\n",{"type":14,"tag":15,"props":36,"children":39},{"className":37},[38],"mainText",[40,42,46,48,51,53,56,57,60,62,69],{"type":26,"value":41},"\nTerror Nightmare Towers (TNT) ist ein faszinierendes Horror-Brettspiel, das im Rahmen eines Praktikumsmoduls für Software Engineering entstanden ist. Dieses innovative Projekt wurde von einem engagierten Team von Studierenden entwickelt, die ihre Programmier- und Designfähigkeiten in die Praxis umsetzen wollten. \n",{"type":14,"tag":43,"props":44,"children":45},"br",{},[],{"type":26,"value":47}," ",{"type":14,"tag":43,"props":49,"children":50},{},[],{"type":26,"value":52},"\nTNT ist inspiriert vom beliebten Spiel Santorini, jedoch mit einer düsteren und gruseligen Wendung. Die Spieler finden sich in einer alptraumhaften Stadt wieder, die von geisterhaften Kreaturen und übernatürlichen Fallen heimgesucht wird. Ihre Aufgabe ist es, inmitten dieses Schreckens Türme zu errichten und strategisch zu platzieren. Das Spiel bietet eine intensive Mischung aus Strategie und Horror. Während die Spieler ihre Türme bauen, müssen sie gleichzeitig gegen die ständig drohenden Gefahren ankämpfen. Geisterhafte Wesen und mysteriöse Ereignisse stellen ihre Fähigkeiten und Nerven auf die Probe. Jeder Zug muss sorgfältig geplant werden, um den Fallen zu entkommen und die Konkurrenz zu überlisten. ",{"type":14,"tag":43,"props":54,"children":55},{},[],{"type":26,"value":47},{"type":14,"tag":43,"props":58,"children":59},{},[],{"type":26,"value":61}," TNT zeichnet sich durch seine innovativen Spielmechaniken aus. Die Spieler können spezielle Fähigkeiten einsetzen, um sich gegen die Schrecken zu wehren und Vorteile im Spiel zu erlangen. Diese Fähigkeiten müssen klug eingesetzt werden, um den größten Nutzen daraus zu ziehen und die Gegner zu übertrumpfen. Das Spiel besticht nicht nur durch seine spannende Thematik, sondern auch durch sein eindrucksvolles Design. Die detailreich gestalteten Spielmaterialien und die stimmungsvolle Atmosphäre tragen dazu bei, dass die Spieler vollständig in die Welt der Terror Nightmare Towers eintauchen können. Terror Nightmare Towers ist ein beeindruckendes Beispiel dafür, wie kreative Ideen und technische Fertigkeiten im Rahmen eines Software Engineering Praktikums zu einem einzigartigen und fesselnden Brettspiel verschmelzen können. Es zeigt, wie interdisziplinäres Arbeiten und innovative Ansätze zu außergewöhnlichen Spielerlebnissen führen können.\n",{"type":14,"tag":15,"props":63,"children":66},{"className":64},[65],"galery",[67],{"type":26,"value":68},"\nGalerie\n",{"type":14,"tag":70,"props":71,"children":72},"carousel",{},[],{"title":7,"searchDepth":74,"depth":74,"links":75},2,[],"markdown","content:de:projects:tnt.md","content","de/projects/tnt.md","md",1721315687374]