{"generatedAt":1721316706932,"generateTime":179,"contents":[{"_path":"/de/projects/tnt","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"Terror Nightmare Towers - Hering","description":"","desc":"Terror Nightmare Towers ist ein Horror-Brettspiel, das auf dem beliebten Spiel Santorini basiert. In dieser düsteren Version bauen die Spieler Türme in einer von Albträumen heimgesuchten Stadt. Während du strategisch Türme errichtest, musst du gegen geisterhafte Kreaturen und übernatürliche Fallen kämpfen. Nutze spezielle Fähigkeiten, um den Schrecken zu trotzen und der beste Baumeister der Terror Nightmare Towers zu werden!","body":{"type":"root","children":[{"type":"element","tag":"div","props":{"className":["containermd"]},"children":[{"type":"element","tag":"h1","props":{"id":"terror-nightmare-towers"},"children":[{"type":"text","value":"Terror Nightmare Towers"}]},{"type":"element","tag":"div","props":{"className":["date"]},"children":[{"type":"text","value":"\nErscheinungsdatum: 02.08.2023\n"}]},{"type":"element","tag":"div","props":{"className":["mainText"]},"children":[{"type":"text","value":"\nTerror Nightmare Towers (TNT) ist ein faszinierendes Horror-Brettspiel, das im Rahmen eines Praktikumsmoduls für Software Engineering entstanden ist. Dieses innovative Projekt wurde von einem engagierten Team von Studierenden entwickelt, die ihre Programmier- und Designfähigkeiten in die Praxis umsetzen wollten. \n"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nTNT ist inspiriert vom beliebten Spiel Santorini, jedoch mit einer düsteren und gruseligen Wendung. Die Spieler finden sich in einer alptraumhaften Stadt wieder, die von geisterhaften Kreaturen und übernatürlichen Fallen heimgesucht wird. Ihre Aufgabe ist es, inmitten dieses Schreckens Türme zu errichten und strategisch zu platzieren. Das Spiel bietet eine intensive Mischung aus Strategie und Horror. Während die Spieler ihre Türme bauen, müssen sie gleichzeitig gegen die ständig drohenden Gefahren ankämpfen. Geisterhafte Wesen und mysteriöse Ereignisse stellen ihre Fähigkeiten und Nerven auf die Probe. Jeder Zug muss sorgfältig geplant werden, um den Fallen zu entkommen und die Konkurrenz zu überlisten. "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" TNT zeichnet sich durch seine innovativen Spielmechaniken aus. Die Spieler können spezielle Fähigkeiten einsetzen, um sich gegen die Schrecken zu wehren und Vorteile im Spiel zu erlangen. Diese Fähigkeiten müssen klug eingesetzt werden, um den größten Nutzen daraus zu ziehen und die Gegner zu übertrumpfen. Das Spiel besticht nicht nur durch seine spannende Thematik, sondern auch durch sein eindrucksvolles Design. Die detailreich gestalteten Spielmaterialien und die stimmungsvolle Atmosphäre tragen dazu bei, dass die Spieler vollständig in die Welt der Terror Nightmare Towers eintauchen können. Terror Nightmare Towers ist ein beeindruckendes Beispiel dafür, wie kreative Ideen und technische Fertigkeiten im Rahmen eines Software Engineering Praktikums zu einem einzigartigen und fesselnden Brettspiel verschmelzen können. Es zeigt, wie interdisziplinäres Arbeiten und innovative Ansätze zu außergewöhnlichen Spielerlebnissen führen können.\n"},{"type":"element","tag":"div","props":{"className":["galery"]},"children":[{"type":"text","value":"\nGalerie\n"}]},{"type":"element","tag":"carousel","props":{},"children":[]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:de:projects:tnt.md","_source":"content","_file":"de/projects/tnt.md","_extension":"md"},{"_path":"/de/projects/vptracker","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"VP-Tracker - Hering","description":"","desc":"Der VP-Tracker ist eine praktische Anwendung für Studierende und Universitätsmitarbeitende zur Verwaltung von Versuchspersonenstunden. Mit diesem Tool können Nutzer ihre Teilnahme an Studien einfach erfassen, verwalten und nachverfolgen. Der VP-Tracker bietet eine übersichtliche Benutzeroberfläche, in der sowohl geleistete als auch noch benötigte Stunden angezeigt werden. So behalten alle Beteiligten stets den Überblick über ihren Fortschritt und die Erfüllung der Studienanforderungen.","src":"../../assets/images/StudentPageCropped.png","body":{"type":"root","children":[{"type":"element","tag":"div","props":{"className":["containermd"]},"children":[{"type":"element","tag":"h1","props":{"id":"vp-tracker"},"children":[{"type":"text","value":"VP-Tracker"}]},{"type":"element","tag":"div","props":{"className":["date"]},"children":[{"type":"text","value":"\nErscheinungsdatum: 31.03.2024\n"}]},{"type":"element","tag":"div","props":{"className":["mainText"]},"children":[{"type":"text","value":"\nVP-Tracker ist eine praktische Anwendung, die während eines Bachelorprojekts von einer Gruppe von drei engagierten Studierenden entwickelt wurde. Dieses Projekt entstand aus der Notwendigkeit heraus, eine effiziente Lösung zur Verwaltung von Versuchspersonenstunden zu schaffen, die sowohl für Studierende als auch für Universitätsmitarbeitende einfach zu handhaben ist. Die VP-Tracker-Anwendung ermöglicht es Nutzern, ihre Teilnahme an Studien unkompliziert zu erfassen, zu verwalten und nachzuverfolgen. Mit einer übersichtlichen und benutzerfreundlichen Oberfläche zeigt der Tracker sowohl geleistete als auch noch benötigte Stunden an, sodass alle Beteiligten stets den Überblick über ihren Fortschritt und die Erfüllung der Studienanforderungen behalten. "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" Ein zentrales Feature des VP-Trackers ist seine intuitive Bedienbarkeit. Die Benutzer können ihre Daten schnell eingeben und aktualisieren, was die Verwaltung der Versuchspersonenstunden erheblich vereinfacht. Zudem bietet die Anwendung verschiedene Ansichten und Filteroptionen, um die benötigten Informationen schnell zu finden. Die Entwicklung des VP-Trackers im Rahmen eines Bachelorprojekts bot den Studierenden die Gelegenheit, ihre Fähigkeiten in Softwareentwicklung, Projektmanagement und Teamarbeit zu vertiefen. Sie arbeiteten eng zusammen, um Anforderungen zu definieren, Lösungen zu entwerfen und die Anwendung zu implementieren. Dabei setzten sie moderne Technologien und bewährte Methoden des Software Engineering ein, um ein zuverlässiges und effizientes Tool zu schaffen. Insgesamt ist der VP-Tracker ein herausragendes Beispiel dafür, wie studentische Projekte praxisrelevante Lösungen hervorbringen können, die den Alltag an Universitäten erleichtern. Die Zusammenarbeit im Team und die Anwendung theoretischer Kenntnisse in einem realen Projektkontext führten zu einem wertvollen Werkzeug, das Studierenden und Universitätsmitarbeitenden gleichermaßen zugutekommt.\n"},{"type":"element","tag":"div","props":{"className":["galery"]},"children":[{"type":"text","value":"\nGalerie\n"}]},{"type":"element","tag":"carousel","props":{},"children":[]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:de:projects:vptracker.md","_source":"content","_file":"de/projects/vptracker.md","_extension":"md"},{"_path":"/en/projects/tnt","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"Terror Nightmare Towers - Hering","description":"","desc":"Terror Nightmare Towers is a horror board game based on the popular game Santorini. In this dark version, players build towers in a nightmare-haunted city. While strategically constructing towers, you must fight against ghostly creatures and supernatural traps. Use special abilities to withstand the horrors and become the best builder of the Terror Nightmare Towers!","body":{"type":"root","children":[{"type":"element","tag":"div","props":{"className":["containermd"]},"children":[{"type":"element","tag":"h1","props":{"id":"terror-nightmare-towers"},"children":[{"type":"text","value":"Terror Nightmare Towers"}]},{"type":"element","tag":"div","props":{"className":["date"]},"children":[{"type":"text","value":"\nRelease Date: 08/02/2023\n"}]},{"type":"element","tag":"div","props":{"className":["mainText"]},"children":[{"type":"text","value":"\nTerror Nightmare Towers (TNT) is a fascinating horror board game developed as part of a software engineering internship module. This innovative project was created by a dedicated team of students who wanted to put their programming and design skills into practice. \n"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nTNT is inspired by the popular game Santorini, but with a dark and eerie twist. Players find themselves in a nightmarish city haunted by ghostly creatures and supernatural traps. Their task is to build and strategically place towers amidst this terror. The game offers an intense mix of strategy and horror. While building their towers, players must simultaneously fight against the ever-present dangers. Ghostly beings and mysterious events test their skills and nerves. Every move must be carefully planned to avoid traps and outsmart the competition.\n"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nTNT stands out for its innovative game mechanics. Players can use special abilities to defend against the horrors and gain advantages in the game. These abilities must be used wisely to maximize their benefits and outmaneuver opponents. The game impresses not only with its thrilling theme but also with its striking design. The intricately designed game materials and atmospheric setting help players fully immerse themselves in the world of Terror Nightmare Towers.\n"},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Terror Nightmare Towers is an impressive example of how creative ideas and technical skills can merge into a unique and captivating board game within the framework of a software engineering internship. It shows how interdisciplinary work and innovative approaches can lead to extraordinary gaming experiences."}]},{"type":"element","tag":"div","props":{"className":["galery"]},"children":[{"type":"text","value":"\nGalery\n"}]},{"type":"element","tag":"carousel","props":{},"children":[]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:en:projects:tnt.md","_source":"content","_file":"en/projects/tnt.md","_extension":"md"},{"_path":"/en/projects/vptracker","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"VP-Tracker - Hering","description":"","desc":"The VP-Tracker is a convenient application for students and university staff to manage participation hours. With this tool, users can easily record, manage, and track their participation in studies. The VP-Tracker offers a clear user interface that displays both completed and required hours. This way, all participants can always keep track of their progress and the fulfillment of study requirements.","body":{"type":"root","children":[{"type":"element","tag":"div","props":{"className":["containermd"]},"children":[{"type":"element","tag":"h1","props":{"id":"vp-tracker"},"children":[{"type":"text","value":"VP-Tracker"}]},{"type":"element","tag":"div","props":{"className":["date"]},"children":[{"type":"text","value":"\nRelease Date: 03/31/2024\n"}]},{"type":"element","tag":"div","props":{"className":["mainText"]},"children":[{"type":"text","value":"\nVP-Tracker is a practical application developed by a group of three dedicated students during a bachelor’s project. This project arose from the need to create an efficient solution for managing participation hours, which is easy to handle for both students and university staff. The VP-Tracker application allows users to easily record, manage, and track their participation in studies. With a clear and user-friendly interface, the tracker displays both completed and required hours, ensuring that all participants can always keep track of their progress and the fulfillment of study requirements.\n"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":" "},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nA central feature of the VP-Tracker is its intuitive usability. Users can quickly enter and update their data, significantly simplifying the management of participation hours. Additionally, the application offers various views and filter options to quickly find the necessary information.\n"},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The development of the VP-Tracker as part of a bachelor’s project provided the students with the opportunity to deepen their skills in software development, project management, and teamwork. They worked closely together to define requirements, design solutions, and implement the application. In doing so, they employed modern technologies and proven methods of software engineering to create a reliable and efficient tool."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Overall, the VP-Tracker is an outstanding example of how student projects can produce practical solutions that facilitate everyday university life. The collaboration within the team and the application of theoretical knowledge in a real project context resulted in a valuable tool that benefits both students and university staff alike."}]},{"type":"element","tag":"div","props":{"className":["galery"]},"children":[{"type":"text","value":"\nGalery\n"}]},{"type":"element","tag":"carousel","props":{},"children":[]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:en:projects:vptracker.md","_source":"content","_file":"en/projects/vptracker.md","_extension":"md"}],"navigation":[{"title":"De","_path":"/de","children":[{"title":"Projects","_path":"/de/projects","children":[{"title":"Terror Nightmare Towers - Hering","_path":"/de/projects/tnt"},{"title":"VP-Tracker - Hering","_path":"/de/projects/vptracker"}]}]},{"title":"En","_path":"/en","children":[{"title":"Projects","_path":"/en/projects","children":[{"title":"Terror Nightmare Towers - Hering","_path":"/en/projects/tnt"},{"title":"VP-Tracker - Hering","_path":"/en/projects/vptracker"}]}]}]}