[{"data":1,"prerenderedAt":83},["ShallowReactive",2],{"content-query-k3bPZvTZ1I":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"desc":9,"body":10,"_type":78,"_id":79,"_source":80,"_file":81,"_extension":82},"/en/projects/vptracker","projects",false,"","VP-Tracker - Hering","The VP-Tracker is a convenient application for students and university staff to manage participation hours. With this tool, users can easily record, manage, and track their participation in studies. The VP-Tracker offers a clear user interface that displays both completed and required hours. This way, all participants can always keep track of their progress and the fulfillment of study requirements.",{"type":11,"children":12,"toc":75},"root",[13],{"type":14,"tag":15,"props":16,"children":19},"element","div",{"className":17},[18],"containermd",[20,28,35],{"type":14,"tag":21,"props":22,"children":24},"h1",{"id":23},"vp-tracker",[25],{"type":26,"value":27},"text","VP-Tracker",{"type":14,"tag":15,"props":29,"children":32},{"className":30},[31],"date",[33],{"type":26,"value":34},"\nRelease Date: 03/31/2024\n",{"type":14,"tag":15,"props":36,"children":39},{"className":37},[38],"mainText",[40,42,46,48,51,53,59,64,71],{"type":26,"value":41},"\nVP-Tracker is a practical application developed by a group of three dedicated students during a bachelor’s project. This project arose from the need to create an efficient solution for managing participation hours, which is easy to handle for both students and university staff. The VP-Tracker application allows users to easily record, manage, and track their participation in studies. With a clear and user-friendly interface, the tracker displays both completed and required hours, ensuring that all participants can always keep track of their progress and the fulfillment of study requirements.\n",{"type":14,"tag":43,"props":44,"children":45},"br",{},[],{"type":26,"value":47}," ",{"type":14,"tag":43,"props":49,"children":50},{},[],{"type":26,"value":52},"\nA central feature of the VP-Tracker is its intuitive usability. Users can quickly enter and update their data, significantly simplifying the management of participation hours. Additionally, the application offers various views and filter options to quickly find the necessary information.\n",{"type":14,"tag":54,"props":55,"children":56},"p",{},[57],{"type":26,"value":58},"The development of the VP-Tracker as part of a bachelor’s project provided the students with the opportunity to deepen their skills in software development, project management, and teamwork. They worked closely together to define requirements, design solutions, and implement the application. In doing so, they employed modern technologies and proven methods of software engineering to create a reliable and efficient tool.",{"type":14,"tag":54,"props":60,"children":61},{},[62],{"type":26,"value":63},"Overall, the VP-Tracker is an outstanding example of how student projects can produce practical solutions that facilitate everyday university life. The collaboration within the team and the application of theoretical knowledge in a real project context resulted in a valuable tool that benefits both students and university staff alike.",{"type":14,"tag":15,"props":65,"children":68},{"className":66},[67],"galery",[69],{"type":26,"value":70},"\nGalery\n",{"type":14,"tag":72,"props":73,"children":74},"carousel",{},[],{"title":7,"searchDepth":76,"depth":76,"links":77},2,[],"markdown","content:en:projects:vptracker.md","content","en/projects/vptracker.md","md",1721315687187]